The Rebar's hooks do not match its Rebar Shape.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId RebarHooksDontMatchShape { get; }
  Visual Basic
Public Shared ReadOnly Property RebarHooksDontMatchShape As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ RebarHooksDontMatchShape {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarFailures Class
  Autodesk.Revit.DB Namespace